Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: On other systems, you may want to use `xinetd`, a script in your `sysvinit` system, or something else — as long as you get that command daemonized and watched somehow.
es: En otros sistemas operativos, puedes utilizar 'xinetd', un script en el sistema 'sysvinit', o alguna otra manera --siempre y cuando demonizes el comando y puedas monitorizarlo--.

source: Suppose you’ve decided that your issue #53 work is complete and ready to be merged into your `master` branch.
es: Supongamos que tu trabajo con el problema #53 está ya completo y listo para fusionarlo (merge) con la rama 'master'.

source: Switching branches with submodules in them can also be tricky.
es: Intercambiar ramas con submódulos tiene también sus peculiaridades.

source: For instance, if Jessica sends you an e-mail saying that she has a great new feature in the `ruby-client` branch of her repository, you can test it by adding the remote and checking out that branch locally:
es: Por ejemplo, si Jessica te envia un correo electrónico comentandote que tiene una nueva e interesante funcionalidad en la rama 'ruby-client' de su repositorio. Puedes probarla añadiendo el remoto correspondiente y recuperando localmente dicha rama.

source: How does Git know what branch you’re currently on?
es: Y, ¿cómo sabe Git en qué rama estás en este momento?

source: Instead of
es: En lugar de

source: All the script does is get the latest commit date from the `git log` command, stick that into any `$Date$` strings it sees in stdin, and print the results — it should be simple to do in whatever language you’re most comfortable in.
es: Simplemente, utiliza el comando 'git log' para obtener la fecha de la última confirmación de cambios, y sustituye con ella todas las cadenas '$Date$' que encuentre en el flujo de entrada stdin; imprimiendo luego los resultados. --Debería de ser sencillo de implementarlo en cualquier otro lenguaje que domines.--

source: In Chapter 7, we’ll discuss how you can change this default value for your environment.
es: En el capítulo 7 se verá cómo cambiar este valor por defecto de tu entorno de trabajo.

source: I hope you can use your newfound knowledge of Git internals to implement your own cool application of this technology and feel more comfortable using Git in more advanced ways.
es: Espero que uses este nuevo conocimiento profundo de las entrañas de Git para implementar tus propias aplicaciones y para que te encuentres más confortable trabajando con Git de forma avanzada.

source: Insert 18333fig0514.png Figure 5-14.
es: Insert 18333fig0514.png Figura 5-14.

source: Everyone knows that Word is the most horrific editor around; but, oddly, everyone uses it.
es: Todo el mundo conoce el hecho de que Word es el editor más horroroso de cuantos hay; pero, desgraciadamente, todo el mundo lo usa.

source: Or you can do this:
es: O como:

source: To phrase that another way, when you try to merge one commit with a commit that can be reached by following the first commit’s history, Git simplifies things by moving the pointer forward because there is no divergent work to merge together — this is called a "fast forward".
es: Dicho de otro modo: cuando intentas fusionar una confirmación con otra confirmación accesible siguiendo directamente el registro de la primera; Git simplifica las cosas avanzando el puntero, ya que no hay ningûn otro trabajo divergente a fusionar. Esto es lo que se denomina "avance rápido" ("fast forward").

source: ### The SSH Protocol ###
es: ### El Procotolo SSH ###

source: ### Integration-Manager Workflow ###
es: ### Flujo de trabajo del Gestor-de-Integraciones ###

source: In most projects, that’s `.git/hooks`.
es: En la mayoría de proyectos, estará en '.git/hooks'.

source: In this case, choose `1c002dd....` If you `git show` that commit, the following commands are equivalent (assuming the shorter versions are unambiguous):
es: En este caso, escogiendo '1c002dd....', para lanzar el comando 'git show' sobre esa confirmación de cambios concreta, serían equivalentes todos estos comandos (asumiendo la no ambiguedad de todas las versiones cortas indicadas):

source: The process works like this (see Figure 5-3):
es: El proceso funciona como sigue (ver Figura 5-3):

source: For instance, you can add a remote called `origin` and push your `master` branch to it:
es: Por ejemplo, puedes añadir un remoto denominado `origin` y enviar a él tu rama `master`:

source: When you restart Apache, you should be able to clone your repositories under that directory by specifying the URL for your project:
es: Una vez reinicies Apache, ya deberias ser capaz de clonar tus repositorios bajo dicha carpeta, simplemente indicando la URL de tu projecto:

source: These are the "clean" and "smudge" filters.
es: Esos son los filtros "clean" y "smudge".

source: Now, you need to make Apache use CGI for that script, for which you can add a VirtualHost:
es: A continuación, tienes que preparar Apache para que utilice dicho script, Para ello, puedes añadir un VirtualHost:

source: If you’re programming on Windows or using another system but working with people who are programming on Windows, you’ll probably run into line-ending issues at some point.
es: Si estás programando en Windows o utilizando algún otro sistema, pero colaborando con gente que programa en Windows. Es muy posible que alguna vez te topes con problemas de finales de línea.

source: This shows your other branch.
es: Esto nos muestra la otra rama en el proyecto.

source: To use this, specify `git-shell` instead of bash or csh for your user’s login shell.
es: Para especificar el 'git-shell' en lugar de bash o de csh como el shell de inicio de sesión de un usuario,

source: ## Public Access ##
es: ## Acceso público ##

source: The `keydir` directory is where you store the public keys of all the users who have any sort of access to your repositories — one file per user.
es: La carpeta 'keydir' es donde almacenarás las claves públicas para los usuarios con acceso a tus repositorios --un archivo por usuario--.

source: In this case, you’d do your work in a branch and then rebase your work onto `origin/master` when you were ready to submit your patches to the main project.
es: En casos como esos, puedes trabajar sobre una rama y luego reorgainzar lo realizado en la rama 'origin/master' cuando lo tengas todo listo para enviarlo al proyecto principal.

source: It’s generally used by huge projects with hundreds of collaborators; one famous example is the Linux kernel.
es: Se utiliza generalmente en proyectos muy grandes, con cientos de colaboradores. Un ejemplo muy conocido es el del kernel de Linux.

source: If you look in your objects directory, you’ll find that most of your objects are gone, and a new pair of files has appeared:
es: Tras esto, si miras los objetos presentes en la carpeta, veras que han desaparecido la mayoria de los que habia anteriormente. Apareciendo un par de objetos nuevos:

source: Now you can revert the file back to the first version
es: Podrás revertir el archivo a su primera versión:

source: The `git branch` command does more than just create and delete branches.
es: El comando 'git branch' tiene más funciones que las de crear y borrar ramas.

source: It’s generally a good idea to do this in a testing branch and then hard-reset your master branch after you’ve determined the outcome is what you really want.
es: Una recomendación: en general, suele ser buena idea lanzar cualquiera de estas operaciones primero sobre una rama de pruebas y luego reinicializar (hard-reset) la rama maestra (master), una vez se haya comprobado que el resultado de las operaciones es el esperado.

source: The GitHub user signup form.
es: El formulario de registro en GitHub.

source: As you’re working, Git silently records what your HEAD is every time you change it.
es: Según trabajas, Git suele guardar un silencioso registro de donde está HEAD en cada momento.

source: For example, to modify only the third commit message, you change the file to look like this:
es: Por ejemplo, para modificar solo el mensaje de la tercera confirmación de cambios, el script quedaria:

source: You’ll be able to watch Git rewriting trees and commits and then move the branch pointer at the end.
es: Y se iria viendo como Git reescribe árboles y confirmaciones de cambio, hasta que el apuntador de la rama llegue al final.

source: Let’s switch back to the master branch:
es: Volvamos ahora a la rama 'master':

source: You have two nearly identical 12K objects on your disk.
es: Y, así, tienes en tu disco dos objetos de 12 Kbytes prácticamente idénticos.

source: The first thing you need to do is set up a free user account.
es: El primer paso es dar de alta una cuenta gratuita.

source: When you specify a subtree merge, Git is smart enough to figure out that one is a subtree of the other and merge appropriately — it’s pretty amazing.
es: Cuando se solicita una fusión subarborea, Git es lo suficientemente inteligente como para imaginarse por si solo que uno de los proyectos es un subárbol del otro y obrar en consecuencia. Es realmente sorprendente.

source: Also, because we’re recording the parents when we commit, finding a proper merge base for merging is automatically done for us and is generally very easy to do.
es: Y, además, debido a que se almacenan tambien los nodos padre para cada confirmación, el encontrar las bases adecuadas para realizar una fusión entre ramas es un proceso automático y generalmente sencillo de realizar.

source: She’s ready to push up her work, but gets an e-mail from Josie that a branch with some initial work on it was already pushed to the server as `featureBee`.
es: Cuando está preparada para enviar (push) su trabajo, recibe un correo-e de Josie de que ha puesto en el servidor una rama denominada 'featureBee', con algo de trabajo.

source: Now you can fast-forward your master branch (see Figure 3-33):
es: Y, tras esto, ya puedes avanzar la rama principal (ver Figura 3-33):

source: That command did two things.
es: Este comando realiza dos acciones:

source: If John, Josie, and Jessica all sign up for accounts on GitHub, and you want to give them push access to your repository, you can add them to your project as collaborators.
es: Si tanto John, como Josie, como Jessica, todos ellos registran sus respectivas cuentas en GitHub. Y deseas darles acceso de escritura a tu repositorio. Puedes incluirlos en tu proyecto como colaboradores.

source: Everything is set up.
es: Una vez esté todo listo.

source: ### Deleting References ###
es: ### Borrando referencias ###

source: If you want to do something one time, you can specify the refspec on the command line, too.
es: Para hacerlo puntualmente en un momento concreto, puedes especificar la referencia directamente en la linea de comando.

source: You’ll use a Perl expression to clean that up on commit:
es: Puedes utilizar una expresión Perl para limpiarlos (clean) al almacenarlos (commit):

source: The ability of smaller subgroups of a team to collaborate via remote branches without necessarily having to involve or impede the entire team is a huge benefit of Git.
es: La habilidad para que pequeños subgrupos de un equipo colaboren a través de ramas remotas, sin necesidad de tener en cuenta o de perturbar el equipo completo, es un gran beneficio de trabajar con Git.

source: The nice thing about this wrapper setup is that you can change your diff and merge tools easily.
es: Lo bonito de estos ajustes con scripts, es que puedes cambiar facilmente tus herramientas de comparación (diff) y de fusión (merge).

source: This example uses the `-L` option to limit the output to lines 12 through 22:
es: En este ejemplo, se ha utilizado la opción `-L` para limitar la salida a las líneas desde la 12 hasta la 22:

source: It’s important to note that anything your script prints to stdout will be transferred to the client.
es: Cabe destacar que todo lo que se envie a la salida estandar stdout, será transferido al cliente.

source: However, `strings` is available on most Mac and Linux systems, so it may be a good first try to do this with many binary formats.
es: Sin embargo, ya que 'strings' está disponible para la mayor parte de los sistemas Mac y Linux, es buena idea probar primero con él para trabajar con formatos binarios.

source: When you’re finished adding collaborators, you should see a list of them in the Repository Collaborators box (see Figure 4-12).
es: Cuando termines de añadir colaboradores, podrás ver a todos ellos en la lista "Repository Collaborators" (ver Figura 4-12).

source: If you created a working directory from the new tree you just wrote, you would get the two files in the top level of the working directory and a subdirectory named `bak` that contained the first version of the test.txt file.
es: Si crearas una carpeta de trabajo a partir de este nuevo árbol que acabas de escribir, obtendrías los dos archivos en el nivel principal de la carpeta de trabajo y una subcarpeta llamada `bak` conteniendo la primera versión del archivo test.txt.

source: The answer to this issue is the `git stash` command.
es: Y su solución es el comando 'git stash'.

source: You can also have modified and uncommitted files in your working directory when you apply a stash — Git gives you merge conflicts if anything no longer applies cleanly.
es: Es posible incluso aplicar de vuelta cambios sobre un espacio de trabajo inconsistente, donde haya otros cambios o algunos archivos añadidos al área de preparación. (Git notificará de los correspondientes conflictos de fusión si todo ello no se puede aplicar limpiamente.)

source: Insert 18333fig0320.png Figure 3-20.
es: Insert 18333fig0320.png Figura 3-20.

source: ### File Annotation ###
es: ### Anotaciones en los archivos ###

source: #### pre-receive and post-receive ####
es: #### 'pre-receive' y 'post-receive' ####

source: You can take that output, loop through each of those commit SHAs, grab the message for it, and test that message against a regular expression that looks for a pattern.
es: Puedes coger esta salida, establecer un bucle para recorrer cada una de esas confirmaciones de cambios, coger el mensaje de cada una y comprobarlo contra una expresión regular de búsqueda del patrón deseado.

source: If you want to make the `trunk` subdirectory be the new project root for every commit, `filter-branch` can help you do that, too:
es: `filter-branch` puede ser de utilidad para que, por ejemplo, la subcarpeta `trunk` sea la nueva carpeta raiz del proyecto en todas y cada una de las confirmaciones de cambios:

source: Another way to do it is to have your SSH server authenticate from an LDAP server or some other centralized authentication source that you may already have set up.
es: Y una tercera forma es el preparar un servidor SSH autenficado desde un servidor LDAP o desde alguna otra fuente de autenficación externa ya disponible.

source: This combination effectively filters all C source code files through `indent` before committing.
es: El efecto final de esta combinación es el de filtrar todo el código fuente C a través de 'indent' antes de confirmar cambios en él.

source: Git checks for any listed alternates first:
es: Git comprueba primero a ver si en el listado hay alguna alternativa:

source: So, if you want to make a single commit from these three commits, you make the script look like this:
es: Por ejemplo, si se desea hacer una única confirmación de cambios fusionando las tres, el script quedaría en algo como:

source: The pros of using SSH are many.
es: El uso de SSH tiene múltiples ventajas.

source: First you have to find it.
es: Lo primero es localizar el archivo enorme.

source: Furthermore, what overall workflow do you want to use to maintain your project?
es: Yendo aún más lejos, ?cual es el sistema de trabajo que deseas utilizar para el mantenimiento de tu proyecto?

source: Because that server is a subset of the data your `origin` server has right now, Git fetches no data but sets a remote branch called `teamone/master` to point to the commit that `teamone` has as its `master` branch (see Figure 3-26).
es: Debido a que dicho servidor es un subconjunto de de los datos del servidor 'origin' que tienes actualmente, Git no recupera (fetch) ningún dato; simplemente prepara una rama remota llamada 'teamone/master' para apuntar a la confirmación (commit) que 'teamone' tiene en su rama 'master'.

source: Here you can do a number of things, including staging files, unstaging files, staging parts of files, adding untracked files, and seeing diffs of what has been staged.
es: Aquí se pueden lanzar acciones tales como: añadir archivos en el area de preparación (staging), sacar archivos de ella (unstaging), poner solo parte de algún archivo, añadir archivos nuevos que estaban fuera del sistema de control o mostrar diferencias en aquello que se ha añadido.

source: Fast-forwarding the master branch.
es: Avance rápido de la rama 'master'.

source: Again, the public keys look something like this:
es: Y recordando que las claves públicas son algo así como:

source: To upload data to a remote process, Git uses the `send-pack` and `receive-pack` processes.
es: Para enviar datos a un proceso remoto, Git utliza `send-pack` (enviar paquete) y `receive-pack` (recibir paquete).

source: Now, someone else does more work that includes a merge, and pushes that work to the central server.
es: Ahora, otra persona trabaja también sobre ello, realiza una fusión (merge) y lleva (push) su trabajo al servidor central.

source: A GitHub main project page.
es: Una página principal de proyecto GitHub.

source: Git has a few configuration options to help with these issues.
es: Git dispone de algunas opciones de configuración para ayudarnos con estos problemas.

source: It’s also possible for Git to stage certain parts of files and not the rest.
es: También es posible añadir solo ciertas partes de algunos archivos y no otras.

source: You can create your own tree.
es: Puedes crear tu propio árbol.

source: Each time you have a new topic branch to merge in (Figure 5-21), you merge it into `develop` (Figure 5-22); then, when you tag a release, you fast-forward `master` to wherever the now-stable `develop` branch is (Figure 5-23).
es: Cada vez que tengas una nueva rama puntual lista para integrar (Figura 5-21), la fusionarás en la rama 'develop'. Y cuando marques el lanzamiento de una versión estable, avanzarás la rama 'master' hasta el punto donde la rama 'develop' se encuentre en ese momento (Figura 5-23).

source: This technique only works for data that’s still in your reflog, so you can’t use it to look for commits older than a few months.
es: Esta técnica tan solo funciona para información presente en el registro de referencia. No se puede emplear para confirmaciones de cambio de antiguedad superior a unos pocos meses.

source: Here is a method that gives you an associative array where the key is the user name and the value is an array of paths to which the user has write access:
es: Este es un método que te devuelve un array asociativo cuya clave es el nombre del usuario y su valor es un array de ubicaciones (paths) donde ese usuario tiene acceso de escritura:

source: Generally, you’ll pair it with SSH access for the few developers who have push (write) access and have everyone else use `git://` for read-only access.
es: Habitualmente, lo combinarás con un acceso SSH para los pocos desarrolladores con acceso de escritura que envien (push) material. Usando 'git://' para los accesos solo-lectura del resto de personas.

source: I leave it up to you to decide.
es: Lo dejo en tus manos.

source: ### Working in Topic Branches ###
es: ### Trabajando con Ramas Puntuales ###

source: First, let’s review where your repository is at this point:
es: Lo primero es revisar el estado de tu repositorio en ese momento:

source: In this case, I was trying to apply a patch I had already applied.
es: En este caso, estamos intentando incorporar un parche que ya tenemos incorporado.

source: It shows you a list of your staged files, and you can select the ones for which you would like to see the staged diff.
es: Esta muestra una lista de los archivos preparados en el área de preparación, permitiendo la seleccion de aquellos sobre los que se desean ver diferencias.

source: The reason to do it this way is speed — because Git doesn’t have to check out each revision to disk before running your filter, the process can be much, much faster.
es: Con eso conseguimos aumentar la velocidad. El proceso es mucho más rápido, porque Git no ha de activar cada revisión a disco antes de procesar tu filtro.

source: The Git project also has a `maint` branch that is forked off from the last release to provide backported patches in case a maintenance release is required.
es: El proyecto Git dispone también de una rama 'maint' que se bifurca (fork) a partir de la última versión ya lanzada; para trabajar en parches, en caso de necesitarse alguna versión intermedia de mantenimiento.

source: You’ll learn a few of the common uses so you can get an idea of some of the things it’s capable of.
es: Se van a ilustrar unas cuantas de las ocasiones donde se podría utilizar, para dar así una idea de sus capacidades.

source: Also, running `git pull` while on one of these branches fetches all the remote references and then automatically merges in the corresponding remote branch.
es: Igualmente, tecleando 'git pull' mientras estamos en una de esas ramas, recupera (fetch) todas las referencias remotas y las fusiona (merge) automáticamente en la correspondiente rama remota.

source: The first hook that is run is `applypatch-msg`.
es: El primer punto de enganche que se activa es 'applypatch-msg'.

source: To exit the script and reject the push, exit non-zero.
es: Para salir del script y rechazar el envio, recuerda que debes salir con un código distinto de cero.

source: Git provides an easy way to check for this — before you commit, run `git diff --check`, which identifies possible whitespace errors and lists them for you.
es: Git nos permite buscarlos facilmente. Previamente a realizar una confirmación de cambios, lanzar el comando 'git diff --check' para identificar posibles errores de espaciado.

source: If the apply tries to modify a file that you’ve since modified, you’ll get a merge conflict and will have to try to resolve it.
es: Si para recuperar esos cambios se ha de modificar un archivo que también haya sido modificado en los trabajos posteriores, se dará un conflicto de fusión (merge conflict) y será preciso resolverlo manualmente.

source: ### Binary Search ###
es: ### Búsqueda binaria ###

source: Insert 18333fig0521.png Figure 5-21.
es: Insert 18333fig0521.png Figura 5-21.

source: Just for fun, you’ll add the first tree as a subdirectory into this one.
es: Simplemente por diversión, puedes añadir el primer árbol como una subcarpeta de este otro.

source: In this case, to keep the example simple, you’ll only enforce the `avail` directives.
es: En este caso, por razones de simplicidad, vamos a mostrar únicamente la forma de implementar las directivas 'avail' (permitir).

source: The `--no-commit` option tells Git not to automatically record a commit.
es: La opción '--no-commit' indica a Git que no debe registrar automáticamente una confirmación de cambios.

source: Finally, she merges John’s work into her own `featureA` branch:
es: Para terminar, fusiona el trabajo de John en su propia rama 'featureA':

source: Jessica’s commit history now looks something like Figure 5-13.
es: Quedando su historial como se muestra en la Figura 5-13.
